create_clock -name clk -period 20 -waveform {0 10} [get_nets { clk }]
create_clock -name adc_clkl -period 62.5 -waveform {0 31.25} [get_nets { ADC_clk }]
create_clock -name rgmii_rxcl -period 8 -waveform {0 4} [get_nets { rgmii_rxc }]
create_generated_clock -name filter_clkl -source [get_nets { ADC_clk }] -master_clock {adc_clkl} -divide_by 32 -phase 0 [get_nets {differentiator/filter/CLK}]
set_false_path -from [get_clocks {adc_clkl}] -to [get_clocks {clk}]
set_false_path -from [get_clocks {clk}] -to [get_clocks {adc_clkl}]
set_false_path -from [get_clocks {clk}] -to [get_clocks {filter_clkl}]
set_false_path -from [get_clocks {filter_clkl}] -to [get_clocks {clk}]
set_false_path -from [get_clocks {filter_clkl}] -to [get_clocks {rgmii_rxcl}]